
#+TITLE: Hacker Rank: Cracking the Coding Interview
#+AUTHOR: Martín Alsinet
#+DATE: 2017
#+OPTIONS: toc:t ':t num:nil
#+LANGUAGE: en
#+LaTeX_HEADER: \usemintedstyle{default}
#+LaTeX_HEADER: \usepackage{xcolor}
#+LaTeX_HEADER: \definecolor{bg}{rgb}{0.95,0.95,0.95}

**** Naive solution

My first approach to the solution uses a temporary array (=ret=) to store the array to be returned. Since I have to perform *k* left rotations, that means that the first element of the result array will be in the *k* position in the source array. So, we start in the *k* position and push all remaining elements into the result array (from index *k* until *n-1*). Then, we append the elements starting from the beginning of the source array until reaching the *k-1* position so that we have all elements in the result array (from index *0* until *k-1*).

*Implementation* \\ 

#+NAME: Naive solution
#+BEGIN_SRC js :exports both
function left_rotate(n, k, a) {
    ret = [];
    for (var i=k; i<n; i++) {
        ret.push(a[i]);
    }
    for (var j=0; j<k; j++) {
        ret.push(a[j]);
    }
    return ret;
}


function challenge_solution(lines) {
    var n_temp = lines[0].split(' ');
    var n = parseInt(n_temp[0]);
    var k = parseInt(n_temp[1]);
    var a = lines[1].split(" ");;
    return left_rotate(n, k, a).join(" ");
}


// Run all testcases
var folder = "./testcases/arrays-left-rotation";
var tc = require("/app/testcase.js");
return tc.results(
    tc.suite(
        tc.list(folder), challenge_solution
    )
);
#+END_SRC

#+RESULTS: Naive solution
| Test case | Success | Runtime |
| #0        | true    | 1 msec  |
| #1        | true    | 1 msec  |
| #2        | true    | 0 msec  |
| #3        | true    | 0 msec  |
| #4        | true    | 0 msec  |
| #5        | true    | 2 msec  |
| #6        | true    | 3 msec  |
| #7        | true    | 2 msec  |
| #8        | true    | 14 msec |
| #9        | true    | 23 msec |

**** Compact Solution

Actually, I implemented this solution /after/ figuring out the Python solution. When working in Python there is a pythonic and an unpythonic way to write code. Python programmers generally favor list comprehension operations over looping through arrays, so the use of for loops is discouraged. Javascript also has quite powerful array functions, so the compact solution is also a one-liner, but comparing the two versions it is clear that the Python version is easier to read and to understand.

*Implementation* \\ 

#+NAME: Compact Solution
#+BEGIN_SRC js :exports both
function left_rotate(n, k, a) {
    return a.slice(k).concat(a.slice(0,k));
}


function challenge_solution(lines) {
    var n_temp = lines[0].split(' ');
    var n = parseInt(n_temp[0]);
    var k = parseInt(n_temp[1]);
    var a = lines[1].split(" ");;
    return left_rotate(n, k, a).join(" ");
}


//Run all testcases
var folder = "./testcases/arrays-left-rotation";
var tc = require("/app/testcase.js");
return tc.results(
    tc.suite(
        tc.list(folder), challenge_solution
    )
);
#+END_SRC

#+RESULTS: Compact solution
| Test case | Success | Runtime |
| #0        | true    | 0 msec  |
| #1        | true    | 0 msec  |
| #2        | true    | 0 msec  |
| #3        | true    | 0 msec  |
| #4        | true    | 0 msec  |
| #5        | true    | 2 msec  |
| #6        | true    | 1 msec  |
| #7        | true    | 1 msec  |
| #8        | true    | 13 msec |
| #9        | true    | 21 msec |

*** Python Solution

Python list comprehension operators are extremely powerful, so this solution is just a one-liner. The underlying approach is the same, merging two sublists from the original array, the first from the /*k*/ element until the last (/*n-1*/) element, and the second from the first element until the /*(k-1)*/ element. Notice in the =left_rotate= function how cleanly the code follows the algorithm.

#+BEGIN_SRC python :exports both
from testcase import TestCase


def left_rotate(n, k, a):
    return a[k:n] + a[0:k]


def challenge_solution(lines):
    n, k = [int(x) for x in lines[0].split(" ")]
    a = [int(x) for x in lines[1].split(" ")]
    return left_rotate(n, k, a)


# Run all testcases
tc = TestCase("./testcases/arrays-left-rotation");
return tc.results(tc.suite(tc.list(), challenge_solution))
#+END_SRC

#+RESULTS:
| Test case | Success | Runtime |
| #0        | True    | 0 msec  |
| #1        | True    | 0 msec  |
| #2        | True    | 0 msec  |
| #3        | True    | 0 msec  |
| #4        | True    | 0 msec  |
| #5        | True    | 7 msec  |
| #6        | True    | 7 msec  |
| #7        | True    | 2 msec  |
| #8        | True    | 59 msec |
| #9        | True    | 77 msec |

**** Stack based solution

In this case I am using two hashes (=open= and =close=) to build a table of the corresponding opening and closing characters. Then I process the /t/ lines of the input expression array one at a time. For each expression, I check each character and, if it is an opening character (it exists in the =open= hash), I push it into a =stack= array. If the character is a closing character, I compare it to element on the top the stack. If the closing character does not match the element in the top of the stack, then the brackets are not balanced, then I break out of the loop with the =balanced= flag set to false. After all characters have been processed, if the expression is balanced then the stack should be empty (all opening brackets were pushed then popped of the stack when the closing bracket was found). If the stack is empty and there were not unmatched brackets, then the function returns =YES=, otherwise it returns =NO=.

#+BEGIN_SRC js :exports both
function check_expression(exp){
    var open = [];
    open["("] = ")";
    open["["] = "]";
    open["{"] = "}";
    var close = [];
    close["}"] = "{";
    close["]"] = "[";
    close[")"] = "(";
    var stack = [];
    var char;
    var balanced = true;
    for (var i=0; i<exp.length; i++){
        char = exp[i];
        if (open[char]) {
            stack.push(char);
        }
        if (close[char] && (close[char] != stack.pop())) {
            balanced = false;
            break;
        }
    }
    if (balanced && (stack.length==0)) {
        return "YES";
    } else {
        return "NO";
    }
}


function challenge_solution(lines) {
    var output = [];
    var t = parseInt(lines[0]);
    lines.shift();
    output = lines.map(exp => check_expression(exp));
    return output.join("\n")
}


// Run all testcases
var folder = "./testcases/stacks-balanced-brackets";
var tc = require("/app/testcase.js");
return tc.results(
    tc.suite(
        tc.list(folder), challenge_solution
    )
);
#+END_SRC

#+RESULTS:
| Test case | Success | Runtime |
| #0        | true    | 0 msec  |
| #1        | true    | 0 msec  |
| #2        | true    | 0 msec  |
| #3        | true    | 0 msec  |
| #4        | true    | 1 msec  |
| #5        | true    | 0 msec  |
| #6        | true    | 10 msec |
| #7        | true    | 5 msec  |
| #8        | true    | 2 msec  |
| #9        | true    | 7 msec  |
| #10       | true    | 23 msec |
| #11       | true    | 20 msec |
| #12       | true    | 22 msec |
| #13       | true    | 22 msec |
| #14       | true    | 25 msec |
| #15       | true    | 22 msec |
| #16       | true    | 21 msec |
| #17       | true    | 21 msec |
| #18       | true    | 0 msec  |

